app/controllers/gym_shops_controller.rb

SELECT "gym_shops".* FROM "gym_shops"
---
  def index
    @gym_shops = GymShop.all

INSERT INTO "gym_shops" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "123123"], ["description", "123123"], ["user_id", 1], ["created_at", "2025-01-25 14:43:07.501734"], ["updated_at", "2025-01-25 14:43:07.501734"]]
---
  def create
    @gym_shop = current_user.gym_shops.build(gym_shop_params)
    if @gym_shop.save

UPDATE "gym_shops" SET "description" = ?, "updated_at" = ? WHERE "gym_shops"."id" = ?  [["description", "s daas d12321"], ["updated_at", "2025-01-25 15:07:51.443089"], ["id", 2]]
---
  def update
    if @gym_shop.update(gym_shop_params)

DELETE FROM "gym_shops" WHERE "gym_shops"."id" = ?  [["id", 1]]
---
  def destroy
    @gym_shop.destroy

SELECT "gym_shops".* FROM "gym_shops" WHERE "gym_shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_gym_shop
    @gym_shop = GymShop.find(params[:id])